import { PrismaClient } from '@prisma/client';
const prisma = new PrismaClient();

const israeliCities = [
  "Акко",
  "Арад",
  "Ариэль",
  "Аррабе",
  "Афула",
  "Ашдод",
  "Ашкелон",
  "Бака-эль-Гарбия",
  "Бат-Ям",
  "Бейт-Шеан",
  "Бейт-Шемеш",
  "Бейтар-Илит",
  "Беэр-Шева",
  "Беэр-Яаков",
  "Бней-Брак",
  "Ганей-Тиква",
  "Герцлия",
  "Гиватаим",
  "Гиват-Шмуэль",
  "Димона",
  "Иерусалим",
  "Йехуд-Моноссон",
  "Йокнеам",
  "Калансуа",
  "Кармиэль",
  "Кафр-Кара",
  "Кафр-Касем",
  "Кирьят-Ата",
  "Кирьят-Бялик",
  "Кирьят-Гат",
  "Кирьят-Малахи",
  "Кирьят-Моцкин",
  "Кирьят-Оно",
  "Кирьят-Шмона",
  "Кирьят-Ям",
  "Кфар-Саба",
  "Кфар-Йона",
  "Лод",
  "Маале-Адумим",
  "Маалот-Таршиха",
  "Магар",
  "Мигдаль-ха-Эмек",
  "Модиин-Илит",
  "Модиин-Маккабим-Реут",
  "Нагария",
  "Назарет",
  "Ноф-ха-Галиль",
  "Нес-Циона",
  "Нетания",
  "Нетивот",
  "Нешер",
  "Ор-Акива",
  "Ор-Йехуда",
  "Офаким",
  "Петах-Тиква",
  "Раанана",
  "Рамат-Ган",
  "Рамат-ха-Шарон",
  "Рамла",
  "Рахат",
  "Реховот",
  "Ришон-ле-Цион",
  "Рош-ха-Аин",
  "Сахнин",
  "Сдерот",
  "Тайбе",
  "Тамра",
  "Тверия",
  "Тель-Авив",
  "Тира",
  "Тират-Кармель",
  "Умм-эль-Фахм",
  "Хадера",
  "Хайфа",
  "Хариш",
  "Ход-ха-Шарон",
  "Холон",
  "Цфат",
  "Шефарам",
  "Эйлат",
  "Эльад",
  "Явне"
];

async function main() {
  for (const city of israeliCities) {
    await prisma.city.upsert({
      where: { name: city },
      update: {},
      create: { name: city },
    });
  }

  console.log('Города успешно добавлены');
}

main()
  .catch((e) => {
    console.error('Ошибка при сидинге:', e);
  })
  .finally(async () => {
    await prisma.$disconnect();
  });
