import { PrismaClient } from '@prisma/client';
const prisma = new PrismaClient();

const priorityCities = [
  "Весь Израиль", "Центр страны", "Юг страны", "Север страны"
];

const otherCities = [
  "Акко", "Азур", "Арад", "Ариэль", "Аррабе", "Афула", "Ашдод", "Ашкелон", "Бака эль Гарбия", "Бат Ям",
  "Бейт Шеан", "Бейт Шемеш", "Бейтар Илит", "Беэр Шева", "Беэр Яаков", "Бней Брак", "Бней Аиш",
  "Ганей Тиква", "Герцлия", "Гиватаим", "Гиват Шмуэль", "Димона", "Иерусалим", "Йехуд Моноссон",
  "Йокнеам", "Калансуа", "Кармиэль", "Кафр Кара", "Кафр Касем", "Кирьят Ата", "Кирьят Бялик",
  "Кирьят Хаим", "Кирьят Гат", "Кирьят Малахи", "Кирьят Моцкин", "Кирьят Оно", "Кармиель", "Кирьят Шмона",
  "Кирьят Ям", "Кфар Саба", "Кфар Йона", "Лод", "Маале Адумим", "Маалот Таршиха", "Магар", "Модиин",
  "Мигдаль ха Эмек", "Модиин Илит", "Маалот", "Модиин Маккабим Реут", "Нагария", "Назарет", "Ноф ха Галиль",
  "Нес Циона", "Натания", "Нетивот", "Наария", "Нацрат Илит", "Нешер", "Ор Акива", "Ор Йехуда", "Офаким", "Петах Тиква",
  "Раанана", "Рамат Ган", "Рамат ха Шарон", "Рамла", "Рахат", "Реховот", "Ришон ле Цион",
  "Рош Аин", "Сахнин", "Сдерот", "Тайбе", "Тамра", "Тверия", "Тель Авив", "Тира", "Тират Кармель",
  "Умм-эль Фахм", "Хадера", "Хайфа", "Хедера", "Ход Ха Шарон", "Хариш", "Ход ха Шарон", "Холон", "Цфат", "Цомет Канот",
  "Шефарам", "Эйлат", "Эльад", "Явне"
];

async function main() {
  console.log("🗑 Удаляем все вакансии...");
  await prisma.job.deleteMany({});
  console.log("✅ Все вакансии удалены!");

  console.log("🗑 Удаляем всех фейковых пользователей...");
  await prisma.user.deleteMany({
    where: { clerkUserId: { startsWith: "fake_" } }
  });
  console.log("✅ Все фейковые пользователи удалены!");

  console.log("🗑 Удаляем все города...");
  await prisma.city.deleteMany({});
  console.log("✅ Все города удалены!");

  console.log("📌 Добавляем приоритетные города...");
  await prisma.city.createMany({
    data: priorityCities.map(name => ({ name })),
  });

  console.log("📌 Добавляем остальные города...");
  await prisma.city.createMany({
    data: otherCities.map(name => ({ name })),
  });

  console.log("✅ Все города успешно добавлены!");
}

main()
  .catch((e) => {
    console.error("❌ Ошибка при выполнении скрипта:", e);
  })
  .finally(async () => {
    await prisma.$disconnect();
  });
